In [1]:
import numpy as np

In [3]:
import pandas as pd

In [23]:
one = {'A': ['A1','A2','A3','A4'], 'B': ['B1','B2','B3','B4']}
two = {'C': ['C1','C2','C3','C4'], 'D': ['D1','D2','D3','D4']}

In [24]:
data1 = pd.DataFrame(one)

In [25]:
data1

    A   B
0  A1  B1
1  A2  B2
2  A3  B3
3  A4  B4

In [26]:
data2 = pd.DataFrame(two)

In [27]:
data2

    C   D
0  C1  D1
1  C2  D2
2  C3  D3
3  C4  D4

In [28]:
pd.concat([data1, data2], axis=1)

    A   B   C   D
0  A1  B1  C1  D1
1  A2  B2  C2  D2
2  A3  B3  C3  D3
3  A4  B4  C4  D4

In [29]:
pd.concat([data1,data2],axis=0)

     A    B    C    D
0   A1   B1  NaN  NaN
1   A2   B2  NaN  NaN
2   A3   B3  NaN  NaN
3   A4   B4  NaN  NaN
0  NaN  NaN   C1   D1
1  NaN  NaN   C2   D2
2  NaN  NaN   C3   D3
3  NaN  NaN   C4   D4

In [30]:
data2.columns = data1.columns

In [31]:
data2

    A   B
0  C1  D1
1  C2  D2
2  C3  D3
3  C4  D4

In [33]:
new_data = pd.concat([data1,data2],axis=0)

In [38]:
new_data.index = range(len(new_data))

In [39]:
new_data

    A   B
0  A1  B1
1  A2  B2
2  A3  B3
3  A4  B4
4  C1  D1
5  C2  D2
6  C3  D3
7  C4  D4

In [40]:
registrations = pd.DataFrame({'reg_id':[1,2,3,4],'name':['Andrew','Bobo','Claire','David']})
logins = pd.DataFrame({'log_id':[1,2,3,4],'name':['Xavier','Andrew','Yolanda','Bobo']})

In [41]:
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [42]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [47]:
pd.merge(registrations, logins, how='inner',on='name') #getting common rows in inner join

   reg_id    name  log_id
0       1  Andrew       2
1       2    Bobo       4

In [79]:
 new_data = pd.merge(left=registrations,right=logins, how='left', on='name')

In [80]:
new_data

   reg_id    name  log_id
0       1  Andrew     2.0
1       2    Bobo     4.0
2       3  Claire     NaN
3       4   David     NaN

In [83]:
new_data['log_id'].fillna('not applicable',inplace=True)

In [84]:
new_data

   reg_id    name          log_id
0       1  Andrew             2.0
1       2    Bobo             4.0
2       3  Claire  not applicable
3       4   David  not applicable

In [88]:
 new_data1 = pd.merge(left=logins,right=registrations, how='right', on='name')

In [89]:
new_data1

   log_id    name  reg_id
0     2.0  Andrew       1
1     4.0    Bobo       2
2     NaN  Claire       3
3     NaN   David       4

In [90]:
new_data1['log_id'].fillna('not applicable',inplace=True)

In [91]:
new_data1

           log_id    name  reg_id
0             2.0  Andrew       1
1             4.0    Bobo       2
2  not applicable  Claire       3
3  not applicable   David       4

In [96]:
outer_merge = pd.merge(registrations, logins, how='outer', on='name') #gets all the values at a time

In [97]:
outer_merge

   reg_id     name  log_id
0     1.0   Andrew     2.0
1     2.0     Bobo     4.0
2     3.0   Claire     NaN
3     4.0    David     NaN
4     NaN   Xavier     1.0
5     NaN  Yolanda     3.0

In [98]:
outer_merge.fillna("-") #fill empty values

  reg_id     name log_id
0    1.0   Andrew    2.0
1    2.0     Bobo    4.0
2    3.0   Claire      -
3    4.0    David      -
4      -   Xavier    1.0
5      -  Yolanda    3.0